fab-pie/csi_agc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
# CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_1 is not set
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=2000000
CONFIG_ESPTOOLPY_MONITOR_BAUD=2000000

# Deprecated aliases kept so regenerated sdkconfig files stay aligned.
# CONFIG_CONSOLE_UART_DEFAULT is not set
CONFIG_CONSOLE_UART_CUSTOM=y
CONFIG_CONSOLE_UART=y
CONFIG_CONSOLE_UART_NUM=0
CONFIG_CONSOLE_UART_BAUDRATE=2000000
CONFIG_MONITOR_BAUD=2000000
